app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2020-04-25 15:19:34.336551"], ["updated_at", "2020-04-25 15:19:34.336551"]]
---
  def create
  	Post.create(title: params[:post][:title], description: params[:post][:description])